''' 
문2 )  출력 형태:
상품명   수량   단가   금액
-----------------------------------
새우깡    15    450   6750
감자깡    20    300   6000
양파깡    10    350   3500
새우깡    30    450   13500
감자깡    25    300   7500
양파깡    40    350   14000
새우깡    40    450   18000
감자깡    10    300   3000
양파깡    35    350   12250
새우깡    50    450   22500
감자깡    60    300   18000
양파깡    20    350   7000

소계
새우깡 : 135건   소계액 : 60750원
감자깡 : 115건   소계액 : 34500원
양파깡 : 105건   소계액 : 36750원
총계
총 건수 : 355
총 액  : 132000원
'''
def inputfunc2():
    datas2 = [
        "새우깡,15",
        "감자깡,20",
        "양파깡,10",
        "새우깡,30",
        "감자깡,25",
        "양파깡,40",
        "새우깡,40",
        "감자깡,10",
        "양파깡,35",
        "새우깡,50",
        "감자깡,60",
        "양파깡,20",
    ]
    return datas2

# print(inputfunc2())
li2 = []
price = [450, 300, 350]


def food(datas2):

    li2 = [] 
    sum1 = 0 ;sum2 = 0;sum3 = 0

        # split하고 list만들기
    for li in inputfunc2():
        li2.append(li.split(','))

        # 가격 붙이기
    for a in range(len(datas2)):
        if li2[a][0]=='새우깡':
            li2[a].append(450)
        elif li2[a][0]=='감자깡':
            li2[a].append(300)
        else:
            li2[a].append(350)

        # 합계 붙이기
        li2[a].append(int(li2[a][1])*li2[a][2])
        
        # 소계 합계 구하기
        if li2[a][0] == '새우깡':
            sum1 += int(li2[a][1])
        elif li2[a][0] == '감자깡':
            sum2 += int(li2[a][1])
        else:
            sum3 += int(li2[a][1])

        
        # print(li2)
        print(f'상품명: {li2[a][0]},수량: {li2[a][1]},단가: {li2[a][2]}')
    print(f'소계 \n새우깡 : {sum1}건 소계액 : {sum1*450}  \n감자깡 : {sum2}건 소계액 : {sum2*450}\n새우깡 : {sum3}건 소계액 : {sum3*450} \n')

    # return print(f'상품명{li2[0]},수량{li2[2]},단가{li2[2]}') 





print(food(inputfunc2()))